# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Casks
cask "cyberduck"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kindle"
cask "nosql-workbench-for-amazon-dynamodb"
cask "postman"
cask "openjdk"
cask "spotify"
cask "slack"
cask "visual-studio-code"

# Brews
brew "ansible"
brew "awscli"
brew "aws-cdk"
brew "bat"
brew "docker"
brew "docker-compose"
brew "fzf"
brew "ghostscript"
brew "git"
brew "graphviz"
brew "imagemagick"
brew "jq"
brew "librsvg"
brew "mas"
brew "maven"
brew "npm"
brew "pre-commit"
brew "pip"
brew "python"
brew "sbt"
brew "signal"
brew "telnet"
brew "terraform"
brew "ufraw"
brew "vim"


# Mac App Store
# Find name of an App by calling curl "http://itunes.apple.com/lookup?id=715768417" | jq -r ".results[0].trackName"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Magnet", id: 441258766
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
